Repository: 84000/data-translation-memory
Catalog: toh232-v4.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྤྲིན་ཆེན་སྙིང་པོ་ལེགས་སོ་ལེགས་སོ།
en: The Bhagavān replied, “Great Cloud Essence, excellent, excellent!

source: །སྤྲིན་ཆེན་སྙིང་པོ་ཁྱོད་ལེགས་ཀྱིས་གནོད་སེམས་ཀྱི་སེམས་དང་ལྡན་པ་རྣམས་བཟོད་པ་ཐོབ་པར་བྱ་བའི་དོན་དང་། ལེ་ལོ་ཅན་དང་དྲན་པ་ཉམས་པ་རྣམས་བརྩོན་འགྲུས་དང་། བསམ་གཏན་ཐོབ་པར་བྱ་བའི་དོན་དང་མ་འོངས་པའི་སེམས་ཅན་བསོད་ནམས་ཆུང་ངུ་རྣམས་ཀྱི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་ཡུལ་དེ་བཞིན་གཤེགས་པ་ལ་ལེགས་པར་ཞུས་པའི་སྤྲིན་ཆེན་པོའི་མདོའི་ཆར་རྟག་ཏུ་རབ་ཏུ་ཕོབ་ཤིག །
en: Great Cloud Essence, it is excellent that you have asked the Tathāgata this question about the domain of the Tathāgata in order to cause those with malevolent minds to attain acceptance, to cause those who are lazy and lack mindfulness to attain perseverance and concentration, and for the sake of all those future sentient beings with little merit. For their sake, you should constantly shower down the rain of this Great Cloud discourse.

source: སྤྲིན་ཆེན་སྙིང་པོ། སྤྲིན་ཆེན་པོའི་མདོའི་ཡུལ་ལ་ལྟོས།
en: “Great Cloud Essence, observe the domain of this Great Cloud discourse!

source: གྲོང་དང་། གྲོང་ཁྱེར་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་གང་དག་ཏུ་སྤྲིན་ཆེན་པོའི་མདོ་འདི་དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མས་རྒྱས་པར་རབ་ཏུ་སྤྱོད་དམ། འཆད་དམ་སྟོན་པར་བྱེད་པ་དེ་དང་དེར་སྤྲིན་ཆེན་པོའི་ཚོགས་རྣམས་ནམ་མཁའ་ལ་འབྲུག་སྒྲ་འབྱིན་ཅིང་དི་རི་རིར་སྒྲོགས་ལ། དུས་མ་ཡིན་པར་ཡང་ཆར་འབེབས་པར་འགྱུར་རོ། །ས་ཕྱོགས་ཀྱང་རྡོ་རྗེའི་རང་བཞིན་དུ་འགྱུར་རོ། །སེམས་ཅན་དེ་དག་ཀྱང་རྡོ་རྗེའི་རང་བཞིན་དུ་འགྱུར་རོ། །
en: In whichever village, hamlet, province, or capital there are monks, nuns, laymen, or laywomen who extensively practice, uphold, or teach this Great Cloud discourse, in that place a host of great clouds will arise in the sky, resounding with thunder; a great rain will fall, even if it is not the proper season, and the whole region and all sentient beings therein will attain the vajra nature.

source: སྤྲིན་ཆེན་པོའི་མདོ་འདི་ལས་ཡི་གེའི་ཚིག་གསུམ་འམ། བདུན་ཐོས་པར་གྱུར་པ་གང་ཡིན་པའི་སེམས་ཅན་དེ་དག་ལ་སངས་རྒྱས་ཐམས་ཅད་རྗེས་སུ་ཡི་རང་བར་འགྱུར་ན་རྒྱས་པར་རྣམ་པར་འབྱེད་པ་ལྟ་ཅི་སྨོས།
en: If there are sentient beings who come to hear just three or seven words from this Great Cloud discourse, all the buddhas will rejoice in them—how much more will they do so for those sentient beings who extensively analyze this discourse! “

source: སྤྲིན་ཆེན་སྙིང་པོ། སྤྲིན་ཆེན་པོའི་མདོ་ལ་ཟབ་མོ་བརྟན་པའི་ཆུའི་རྒྱ་མཚོའི་དུས་ཚོད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དེ།
en: Great Cloud Essence, within this Great Cloud discourse there is the samādhi called tide of the deep, constant ocean.

source: ཏིང་ངེ་འཛིན་དེ་རྟོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་རྟག་ཏུ་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་ཐོབ་པར་འགྱུར་རོ།
en: All bodhisattva mahāsattvas who realize this samādhi will permanently obtain the awakened qualities of the Tathāgata.

source: །ཐོས་པ་སོགས་པར་ཡང་འགྱུར་རོ།
en: They will accumulate learning.

source: །དེ་བཞིན་གཤེགས་པའི་ཆོས་རྣམས་ལས་ཀྱང་རྟག་ཏུ་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་རོ།
en: They will never backslide from the dharmas of the Tathāgata.

source: །ཤེས་རབ་ཀྱང་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་རོ།
en: They will never backslide from wisdom.

source: །ཡེ་ཤེས་ཀྱང་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་རོ།
en: They will never backslide from gnosis.

source: །དེ་བཞིན་གཤེགས་པའི་རྟག་པ་དང་། བརྟན་པ་དང་། ཐེར་ཟུག་པ་དང་། ཞི་བའི་རང་བཞིན་དང་། ཡོན་ཏན་གྱི་ཚོགས་ངེས་པར་འབྱེད་པའི་བློ་གྲོས་ཅན་དུ་ཡང་འགྱུར་རོ།
en: They will become intelligent in discerning the Tathāgata’s host of virtuous qualities and his permanent, eternal, constant, tranquil nature.

source: །ཆོས་མཉན་པ་དང་། དགེ་འདུན་ལ་བསྙེན་བཀུར་བྱ་བ་དང་ཡང་འབྲལ་བར་མི་འགྱུར་རོ།
en: They will never part from listening to the Dharma and venerating the saṅgha.

source: །བསྡུ་བའི་དངོས་པོ་བཞི་ལ་ཡང་བརྩོན་པར་འགྱུར་རོ།
en: They will exert themselves diligently in the four means of gathering disciples.

source: །སྔར་སྨོས་པའི་ཡོན་ཏན་ཐམས་ཅད་དང་ཡང་ལྡན་ཞིང་མཁས་པར་འགྱུར་གྱིས།
en: And they will become endowed with and skilled in all the virtuous qualities previously mentioned.

source: སྤྲིན་ཆེན་སྙིང་པོ། ཟབ་མོ་བརྟན་པའི་ཆུའི་རྒྱ་མཚོའི་དུས་ཚོད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཟུང་ཤིག །
en: Great Cloud Essence, you should uphold this samādhi called the tide of the deep constant ocean. “

source: སྤྲིན་ཆེན་སྙིང་པོ་གཞན་ཡང་ཟབ་མོ་བརྟན་པའི་ཆུའི་རྒྱ་མཚོའི་དུས་ཚོད་ཀྱི་ཡུལ་ལ་འཇུག་པ་ཟབ་མོ་བརྟན་པའི་ཆུའི་རྒྱ་མཚོའི་དུས་ཚོད་ཀྱི་ཏིང་ངེ་འཛིན་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ལྷའི་གནས་ཐམས་ཅད་ན་ཡང་བྱ་བ་ལ་སྣང་སྟེ།
en: Moreover, Great Cloud Essence, bodhisattva mahāsattvas who obtain this samādhi of the tide of the deep, constant ocean, which enters the domain of the tide of the deep, constant ocean, will be able to manifest activities in all the divine abodes.

source: ཚངས་པ་ལ་དད་པའི་སེམས་ཅན་རྣམས་ཀྱི་མཆོད་པའི་འོས་སོ་སྙམ་པའི་ལྟ་བ་གཅད་པའི་ཕྱིར་ཚངས་པའི་གནས་རྣམས་སུ་ནི་ཚངས་པའི་གཟུགས་ལྟ་བུར་སྣང་སྟེ། ལྟ་བ་ལ་གནས་པར་ཡང་མི་འགྱུར་རོ། །
en: Within the abodes of Brahmā, they will be able to manifest in in the form of Brahmā in order to dispel the views of sentient beings with faith in Brahmā who think, ‘He is worthy of worship,’ and yet they will not be fixated upon that view.

source: དབང་ཕྱུག་ཆེན་པོ་ལ་དད་པའི་སེམས་ཅན་རྣམས་ཀྱི་ལྟ་བ་གཅད་པའི་ཕྱིར་དབང་ཕྱུག་ཆེན་པོའི་གནས་རྣམས་སུ་ནི་དབང་ཕྱུག་ཆེན་པོའི་གཟུགས་ལྟ་བུར་སྣང་སྟེ། ལྟ་བ་ལ་གནས་པར་ཡང་མི་འགྱུར་རོ།
en: Within the abodes of Maheśvara, they will be able to manifest in the form of Maheśvara in order to dispel the views of sentient beings with faith in Maheśvara, and yet they will not be entrenched in that view.

source: །གཞོན་ནུ་ལ་དད་པའི་སེམས་ཅན་རྣམས་ཀྱི་ལྟ་བ་གཅད་པའི་ཕྱིར་གཞོན་ནུའི་གནས་རྣམས་སུ་ནི་གཞོན་ནུའི་གཟུགས་ལྟ་བུར་སྣང་སྟེ། ལྟ་བ་ལ་གནས་པར་ཡང་མི་འགྱུར་རོ།
en: Within the abodes of Kumāra, they will be able to manifest in the form of Kumāra in order to dispel the views of sentient beings with faith in Kumāra, and yet they will not be entrenched in that view.

source: །ཀཱ་ཏྱཱའི་བུའི་སྡིག་པ་དང་། འཚོ་བ་མི་ཟད་པ་ལ་དད་པའི་སེམས་ཅན་རྣམས་ཀྱི་ལྟ་བ་གཅད་པ་དང་། སྲོག་གཅོད་པ་བཟློག་པའི་ཕྱིར། ཀཱ་ཏྱཱའི་བུའི་གནས་རྣམས་སུ་ནི་ཀཱ་ཏྱཱའི་གཟུགས་ལྟ་བུར་སྣང་སྟེ། ལྟ་བ་ལ་གནས་པར་ཡང་མི་འགྱུར་རོ།
en: Within the abodes of Kātyāyanīputra, they will be able to manifest in the form of Kātyāyanī in order to reverse the murderous actions of sentient beings who have faith in the evil deeds and inexhaustible lifespan of Kātyāyanīputra, and yet they will not be entrenched in that view.

source: །སེམས་ཅན་རྣམས་སྡིག་པ་ལས་བཟློག་པའི་ཕྱིར་འབྱུང་པོའི་གནས་རྣམས་སུ་ནི་འབྱུང་པོའི་གཟུགས་ལྟ་བུར་སྣང་ཞིང་ལྟ་བ་ཅན་ཐམས་ཅད་ཀྱི་ལྷའི་གནས་དང་།
en: Within the abodes of the bhūtas, they will be able to manifest in the form of a bhūta in order to reverse the evil deeds of sentient beings.

source: ལྟད་མོ་ཅན་དང་། དགེ་མཚན་ལྟ་བའི་གནས་རྣམས་སུ་ལྟ་བ་ཅན་གྱི་གཟུགས་ལྟ་བུར་སྣང་སྟེ། ལྟ་བ་ལ་གནས་པར་ཡང་མི་འགྱུར་རོ།
en: Within the abodes of the gods who possess various views, or in places where the view of enjoyment or of belief in auspicious signs is prevalent, they will be able to manifest in the form of one who holds such views, and yet they will not be entrenched in those views.

source: །ཤ་ཟ་བ་དང་གསོད་པ་ལས་བཟློག་པའི་ཕྱིར་ཕག་འཚོང་བའི་གནས་སུ་བགེགས་ཀྱི་མཚན་མའི་ཚུལ་སྟོན་ཅིང་ཤ་འཚོང་བ་ལྟ་བུར་ཡང་སྣང་ངོ་།
en: In order to reverse the deeds of meat eaters and butchers, they will display signs of obstacles within the abodes of pig traders, and they will manifest as meat vendors.

source: །སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་རིགས་ཀྱིས་ཆང་འཚོང་བའི་ནང་དུ་ཆང་འཐུང་བ་ལྟ་བུར་ཡང་སྣང་ཞིང་ཆང་གི་ཉེས་དམིགས་ཡང་དག་པར་བསྟན་པའི་ཕྱིར་རིགས་ཀྱི་གཙོ་བོ་ལྟ་བུར་འགྱུར་ཞིང་སེམས་ཅན་རྣམས་ལ་ཆང་གི་སྦྱིན་པ་བྱེད་དེ། ཆང་ལ་ཆགས་པར་ཡང་མི་འགྱུར་རོ།
en: In order to bring sentient beings to full maturity, they will manifest variously within wineshops as drinkers, and in order to correctly demonstrate the faults of drinking wine, they will transform into chieftains and give gifts of wine to all sentient beings, yet they will not become attached to wine. “

source: །དེ་བཞིན་དུ་ལས་ཆེན་པོ་བཅུ་དྲུག་གི་ཉེས་དམིགས་ཡང་དག་པར་བསྟན་པའི་ཕྱིར་ལས་ཆེན་པོ་བཅུ་དྲུག་བྱེད་པའི་རིགས་རྣམས་སུ་སྐྱེས་ནས་ལས་ཆེན་པོ་བཅུ་དྲུག་བྱེད་པ་ལྟ་བུར་ཡང་སྣང་སྟེ། ལས་ལ་ཆགས་པར་ཡང་མི་འགྱུར་རོ།
en: Similarly, in order to correctly demonstrate the faults of the sixteen great occupations, they will take birth within the castes of these sixteen great occupations and manifest as those engaged in these sixteen great occupations, yet they will not become attached to these occupations.

source: །སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་བརྒྱན་པོ་དང་རྩེད་མོ་ལ་ཡང་མཁས་སོ།
en: In order to bring sentient beings to full maturity, they will become skilled at gambling and other amusements.

source: །སེམས་ཅན་དབུལ་པོ་ལོངས་སྤྱོད་མི་ཟད་པས་བསྡུ་བ་དང་།
en: With inexhaustible enjoyments, they will gather destitute sentient beings.

source: ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་ཁྱིམ་ན་གནས་པའི་རྒྱལ་པོར་ཡང་འགྱུར་རོ།
en: In order to completely purify their discipline, they will transform into householder kings.

source: །ཆུང་མ་དང་། བུ་དང་འདྲེ་བ་ཡང་མེད་པར་བུ་སྨད་ཀྱང་སྟོན་ལ་རྟག་ཏུ་ཚངས་པར་སྤྱོད་པ་དང་ཡང་ལྡན་ཞིང་རྟག་ཏུ་དབེན་པ་ན་ཡང་གནས་ཏེ་རྒྱན་གྱིས་བཀླུབས་ལ་མཚན་ཀྱང་ཡོངས་སུ་གཅོད་དོ།
en: Without getting mixed up with wife and children, they will nonetheless display a family, while constantly maintaining pure conduct. Though constantly abiding in solitary places, they will wear ornaments while cutting off any attachment to them.

source: །དེ་ན་ཁ་ཟས་ཀྱང་ཟ་ལ་རྟག་ཏུ་བསམ་གཏན་གྱི་ཟས་ཀྱིས་ཀྱང་འཚོའོ།
en: In those places, though they eat food, they will be constantly sustained by the nourishment of meditation.

source: །ཡ་མཚན་ཅན་དེ་དག་གི་ང་རྒྱལ་དང་། རྒྱགས་པ་དང་། དྲེགས་པ་གཞོམ་པའི་ཕྱིར་ཡ་མཚན་ཅན་ཐམས་ཅད་ཀྱི་ནང་དུ་ཡང་རབ་ཏུ་འབྱུང་སྟེ།
en: In order to destroy the pride, conceit, and haughtiness of non-Buddhist sectarians, they will take birth among the sectarians.

source: ཐམས་ཅད་དུ་མཁན་པོའི་ཐབས་སུ་བཀུར་ཞིང་ལྟས་སུ་ལྟ་བ་ཐམས་ཅད་ངེས་པར་བསྒྲལ་བའི་ཕྱིར་བསམ་པ་ཚུལ་གྱིས་རྟོགས་པར་འགྱུར་ལ།
en: In order to liberate all those who esteem the skill of experts with wide learning, and those who interpret omens, they will attain comprehension of these matters just by thinking about them.

source: ལྟ་བ་ལ་གནས་པར་ཡང་མི་འགྱུར་རོ།
en: Yet they will not become entrenched in their views. “

source: །དུད་འགྲོ་རྣམས་ངེས་པར་བསྒྲལ་བའི་ཕྱིར་དུད་འགྲོའི་སྐྱེ་གནས་ཐམས་ཅད་དུ་ཡང་སྐྱེ་བར་འགྱུར་ཏེ། ཐམས་ཅད་དུ་ཡང་མཆོག་ཏུ་བཀུར་བར་འགྱུར་རོ།
en: In order to liberate animals, they will take birth within the abodes of all the animals and will show them all the highest respect.

source: །སྨད་འཚོང་མའི་གནས་ཀུན་ཏུ་ཡང་སྣང་སྟེ། ཐམས་ཅད་དུ་ཡང་བཀུར་ལ། སྨད་འཚོང་མའི་གནས་ཐམས་ཅད་དུ་གཡོན་ཅན་གྱི་མཆོག་ཏུ་འགྱུར་རོ།
en: They will appear within the abodes of prostitutes, respecting them all, and they will become the best among the rogues within the brothels.

source: །འདུལ་བའི་སེམས་ཅན་ལ་ཕན་པར་བྱ་བའི་ཕྱིར་བཞི་མདོ་དང་། སུམ་མདོ་ཐམས་ཅད་དུ་ཡང་སྣང་ངོ་།
en: In order to work for the benefit of beings to be tamed, they will appear at four-way and three-way crossroads.

source: །འདོད་པའི་ཉེས་པ་བསྟན་པའི་ཕྱིར་སྨད་འཚོང་མའི་གནས་ཐམས་ཅད་དུ་ཡང་འཇུག་གོ།
en: In order to demonstrate the faults of desire, they will enter all the brothels.

source: །དྲན་པ་ལ་ཡང་དག་པར་དགོད་པའི་ཕྱིར་མི་གསལ་བ་དང་། གླེན་པའི་གནས་ཐམས་ཅད་དུ་ཡང་འཇུག་པར་བྱེད་དོ།
en: They will enter into the abodes of all simpletons and those whose minds are unclear, in order to correctly instill mindfulness in them.

source: །སེམས་ཅན་ཡན་ལག་མ་ཚང་བ་ཐམས་ཅད་སྐྱོ་བ་ལ་དགོད་པའི་ཕྱིར་ཡན་ལག་ཐམས་ཅད་མ་ཚང་བར་ཡང་སྟོན་པར་བྱེད་དོ།
en: They will appear with crippled limbs in order to instill disenchantment in those sentient beings with crippled limbs.

source: །འཁོར་བ་ལ་སྐྱོ་བ་བསྐྱེད་པའི་ཕྱིར་ཁམས་བཞི་དང་ལྡན་པར་ཡང་བྱེད་དོ། །
en: In order to generate disenchantment with cyclic existence, they will become endowed with the four elements.

source: ལེ་ལོ་ཅན་དང་། དྲན་པ་ཉམས་པ་རྣམས་དང་། རྒྱགས་པ་དང་། མྱོས་པ་རྣམས་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། སྐྱོ་བ་ལ་དགོད་པའི་ཕྱིར་ནད་བཞི་བརྒྱ་རྩ་བཞི་དང་ལྡན་པར་ཡང་སྟོན་ཏོ།
en: In order to establish perseverance, meditation, and disenchantment in those who are lazy, weak minded, haughty, or intoxicated, they will manifest coming down with the four hundred and four diseases.

source: །བཟོད་པ་ལ་དགོད་པའི་ཕྱིར་གནོད་སེམས་ཅན་ལྟ་བུར་ཡང་འགྱུར་རོ།
en: In order to establish patience, they will appear as malevolent beings. “

source: །རྟག་པའི་འདུ་ཤེས་ཅན་གྱི་སེམས་ཅན་རྣམས་ལ་རྟག་པའི་ཉེས་པ་ཡང་དག་པར་བསྟན་པའི་ཕྱིར་བསྐལ་པ་ཐམས་ཅད་དུ་ཡང་འབྱུང་ངོ་།
en: In order to correctly demonstrate the faults of eternalism to sentient beings who have notions of eternalism, they will take birth in all eons.

source: །ཁྱེའུ་དག་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཡི་གེ་སློབ་པའི་གྲྭ་ཁང་ཐམས་ཅད་དུ་ཡང་འགྲོ་བར་བྱེད་དོ།
en: In order to bring boys to full maturity, they will serve in all schools where letters are taught.

source: །བུ་མོ་དག་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་གླུ་དབྱངས་ཀྱི་ཁང་པ་ཐམས་ཅད་དུ་ཡང་འགྲོ་བར་བྱེད་དོ། །འཇིག་རྟེན་དང་འཐུན་པར་བྱ་བའི་ཕྱིར་རྒན་པོ་དང་། ཐོར་བུ་དང་། བར་མ་རྣམས་ཀྱི་གྲོགས་ཀྱང་བྱེད་དོ།
en: In order to bring girls to full maturity, they will serve in all houses of song. In order to be in harmony with the world, they make friends with elders, strangers, and dancing girls.

source: །སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་བྲན་ཕོ་དང་། བྲན་མོ་དང་། གཞན་གྱིས་བཀོལ་བར་ཡང་འགྲོའོ།
en: In order to bring sentient beings to full maturity, they will act as servants, maids, and hirelings.

source: །སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ནད་པ་དང་། རྒས་པ་དང་། ཤི་བ་ལྟ་བུར་བདག་ཉིད་སྣ་ཚོགས་སུ་ཡང་སྟོན་ཏོ།
en: In order to bring sentient beings to full maturity, they will display themselves variously as sick, aged, and dying.

source: །སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་རིན་པོ་ཆེ་དང་། ནོར་བུ་ཐམས་ཅད་ཀྱི་སྣོད་ལྟ་བུར་ཡང་འགྱུར་རོ།
en: In order to bring sentient beings to full maturity, they become like vessels of precious substances and jewels. “

source: །རིག་བྱེད་ཀྱིས་ཆོག་པར་འཛིན་པའི་སེམས་ཅན་རྣམས་ལ་སྐྱོན་ཡང་དག་པར་བསྟན་པར་བྱ་བའི་ཕྱིར་གསང་ཚིག་དང་རིག་བྱེད་ཐམས་ཅད་ལ་མཁས་པར་ཡང་བྱེད་དོ།
en: In order to make the faults of those sentient beings who hold the Vedas as supreme known to them, they become skilled in mantras and the Vedas.

source: །བྱ་སྐད་ཀྱི་བརྡ་ཐམས་ཅད་ལ་ཞེན་པའི་སེམས་ཅན་རྣམས་ཀྱི་ལྟ་བ་གཅད་པའི་ཕྱིར་བྱ་སྐད་ཀྱི་བརྡ་ཐམས་ཅད་སྟོན་པར་བྱེད་དོ། །
en: In order to eradicate the views of sentient beings who are attached to all forms of divination based on birdcalls, they display all manner of birdcalls.

source: སྨན་གྱི་སྡེ་ཚན་དང་། རྩི་དང་ལྡན་པར་རྣམ་པར་འཕྲུལ་པའི་ཕྱིར་ཤིང་ལྗོན་པ་དང་། འཁྲི་ཤིང་དང་། འབྲས་བུ་དང་། མེ་ཏོག་དང་། སྨན་ནོ་ཅོག་ལྟ་བུར་ཡང་བདག་ཉིད་བྱིན་གྱིས་རློབ་པར་བྱེད་དོ།
en: In order to magically manifest possession of various types of medicinal substances and herbal remedies, they empower themselves to be like all forms of trees, vines, fruits, flowers, and medicines.

source: །འཚོ་ནམ་ཐམས་ཅད་ལ་ཡང་བརྩོན་ལ་ཆགས་པ་དང་ལོངས་སྤྱོད་ལ་མངོན་པར་ཞེན་པ་ཡང་མེད་དོ།
en: They exert themselves toward all forms of merit, while having no acute clinging to desires and enjoyments.

source: །ཐེག་པ་དམན་པ་རྣམ་པར་གཅད་པའི་ཕྱིར་བསྒྲགས་པའི་ཆོས་ཀྱི་འབེལ་བའི་གཏམ་ཐམས་ཅད་ཀྱང་ལེགས་པར་སྟོན་པར་བྱེད་དོ།
en: In order to repudiate lesser vehicles, they brilliantly teach all the elaborate stories that proclaim the Dharma.

source: །སེམས་ཅན་ཐམས་ཅད་བསྲུང་བ་དང་། ཡོངས་སུ་བསྐྱང་བའི་ཕྱིར་རྒྱལ་པོའི་བྱ་བ་ལ་ཡང་འཇུག་པར་བྱེད་དོ།
en: In order to completely guard and protect all sentient beings, they engage in the activities of kings. “

source: །ཚོང་དཔོན་གྱི་ཆོས་ལུགས་ཀྱིས་དགའ་བར་བྱ་བའི་ཕྱིར་ཚོང་དཔོན་གྱི་ནང་དུ་ཡང་ཚོང་དཔོན་དུ་བཀུར་བར་འགྱུར་རོ།
en: In order to cause merchants to be delighted by the traditions of Dharma, they will each become esteemed as the merchant among merchants.

source: །ཁྱིམ་གྱི་སྐྱོན་ཐམས་ཅད་ཡོངས་སུ་གཅད་པའི་ཕྱིར་ཁྱིམ་གྱི་ནང་དུ་ཡང་ཁྱིམ་བདག་ཏུ་བཀུར་བར་འགྱུར་རོ།
en: In order to eradicate the faults of householders, they will become esteemed as the householder among householders.

source: །རྒྱལ་རིགས་ཀྱི་ཆོས་ལུགས་རབ་ཏུ་གནས་པར་བྱ་བའི་ཕྱིར་རྒྱལ་རིགས་ཀྱི་ནང་དུ་ཡང་རྒྱལ་རིགས་སུ་བཀུར་བར་འགྱུར་རོ།
en: In order to establish the royal caste in the traditions of Dharma, they will become esteemed as the royalty among the royal caste.

source: །ང་རྒྱལ་དང་། རྒྱགས་པ་དང་། དྲེགས་པ་གཞོམ་པའི་ཕྱིར་བྲམ་ཟེའི་ནང་དུ་ཡང་བྲམ་ཟེར་བཀུར་བར་འགྱུར་རོ།
en: In order to subdue their pride, conceit, and haughtiness, they will become esteemed as the brahmin among brahmins.

source: །བྱ་བ་ཐམས་ཅད་དང་། ཆོས་ལུགས་ཐམས་ཅད་ལ་གཟུད་པར་བྱ་བའི་ཕྱིར་བློན་པོ་ཆེན་པོའི་ནང་དུ་ཡང་བློན་པོ་ཆེན་པོར་བཀུར་བར་འགྱུར་རོ།
en: In order to cause them to promote all activities and all traditions of Dharma, they will become esteemed as the great minister among great ministers.

source: །རྒྱལ་སྲིད་དང་། ལོངས་སྤྱོད་དང་། དབང་ཕྱུག་ལས་རྣམ་པར་བཟློག་པའི་ཕྱིར་གཞོན་ནུའི་ནང་དུ་ཡང་གཞོན་ནུར་བཀུར་བར་འགྱུར་རོ།
en: In order to cause them to turn away from governance, enjoyments, and lordship, they will become esteemed as the prince among princes.

source: །བུད་མེད་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་བཙུན་མོའི་འཁོར་དག་ཏུ་ཡང་སྲུངས་མ་ཉུང་རུམ་དུ་བཀུར་བར་འགྱུར་རོ།
en: In order to bring all women to full maturity, they will become esteemed as the guardian eunuch among the royal consorts’ retinues.

source: །བསོད་ནམས་ཀྱི་ཁྱད་པར་ལ་ལྷག་པར་དམིགས་པར་བྱ་བའི་ཕྱིར་སྐྱེ་བོ་ཕལ་པ་རྣམས་དང་ཡང་འཐུན་པར་འཇུག་གོ།
en: In order to cause them to perceive the special qualities of merit, they will act in harmony with common people.

source: །དབང་ཕྱུག་གི་ཉེས་དམིགས་བསྟན་པའི་ཕྱིར། བརྒྱ་བྱིན་གྱི་ནང་དུ་ཡང་བརྒྱ་བྱིན་དུ་བཀུར་བར་འགྱུར་རོ།
en: In order to demonstrate the disadvantages of lordship, they will become esteemed as the Śakra among Śakras.

source: །ཡེ་ཤེས་ཀྱི་ཁྱད་པར་བསྟན་པའི་ཕྱིར་ཚངས་པའི་ནང་དུ་ཡང་ཚངས་པར་བཀུར་བར་འགྱུར་རོ།
en: In order to demonstrate the special qualities of gnosis, they will become esteemed as the Brahmā among Brahmās.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡིད་དུ་འོང་བར་བྱ་བའི་ཕྱིར་ཟླ་བར་ཡང་འགྱུར་རོ།
en: In order to please all sentient beings, they will become the moon.

source: །སེམས་ཅན་གྱི་སྡིག་པའི་ཉེས་པའི་ཁ་བ་མང་པོ་བཞུ་བའི་ཕྱིར་ཉི་མར་ཡང་འགྱུར་རོ།
en: In order to melt the great snow of sentient beings’ faulty and negative actions, they will become the sun.

source: །སེམས་ཅན་ཐམས་ཅད་ཚུལ་སྲུང་དུ་གཞུག་པའི་ཕྱིར་འཇིག་རྟེན་སྐྱོང་གི་ནང་དུ་ཡང་འཇིག་རྟེན་སྐྱོང་དུ་བཀུར་བར་འགྱུར་རོ།
en: In order to engage in guarding the conduct of all sentient beings, they will become esteemed as the world guardian among world guardians. “

source: །སངས་རྒྱས་ཀྱི་བཀོད་པ་ཐམས་ཅད་སྟོན་ཀྱང་གཏན་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་ཡང་མི་བྱེད་དོ།
en: Although they display all the manifestations of a buddha, including permanently passing into parinirvāṇa, they will never pass into parinirvāṇa.

source: །གཟུགས་ཐམས་ཅད་སྣང་བར་སྟོན་ཀྱང་གཟུགས་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་ཆོས་ཉིད་རྣམ་པར་འཁྲུག་པར་ཡང་མི་བྱེད་དོ།
en: Although they display the appearance of all different forms, forms do not disrupt them from the actual nature of the Tathāgata.

source: །སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་འགྲོ་ཡང་ཐ་དད་པར་བྱེད་པར་ཡང་མི་བྱེད་དོ།
en: Although they go on to all buddhafields, they do not distinguish between different fields.

source: །སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡང་དག་པར་བླང་བ་རྗེས་སུ་ཐོབ་ཀྱང་ཆོས་ཀྱི་དབྱིངས་ལ་ཡང་འབྱེད་པར་མི་བྱེད་དོ།
en: Although they undertake the deeds of all the buddhas, they make no distinctions with regard to the Dharma realm.

source: །ལྷ་དང་མིའི་བདག་པོ་ཐམས་ཅད་ཡོངས་སུ་འཛིན་ཀྱང་དེ་ལ་རྒྱགས་པར་ཡང་མི་འགྱུར་ལ། མྱོས་པ་སྐྱེད་པར་ཡང་མི་འགྱུར་རོ།
en: Although they hold complete mastery over all gods and humans, they do not become conceited, nor do they become hungry for power.

source: །སེམས་ཅན་རྣམས་སྐྱོ་བ་ལ་དགོད་པའི་ཕྱིར་གཉིད་ལོག་པའི་བྱ་བ་ཐམས་ཅད་ཡང་དག་པར་སྟོན་ཏོ།
en: In order to establish disenchantment in sentient beings, they correctly display all activities of sleeping.

source: །བདུད་ཀྱི་ཡུལ་ཐམས་ཅད་ཡང་དག་པར་སྟོན་ཀྱང་བདུད་ཀྱི་ལས་ལ་གནས་པར་ཡང་མི་འགྱུར་རོ།
en: Although they display all the domains of Māra’s activities, they are not entrenched in the actions of Māra.

source: །འཇིག་རྟེན་པ་དང་འཇིག་རྟེན་ལས་འདས་པའི་བྱ་བ་ཐམས་ཅད་ལ་ཡང་སྣང་ལ། རྟག་ཏུ་ཡང་ཆོས་ཀྱི་ཀུན་དགའ་ལ་དགའ་བས་དགའ་བར་བྱེད་དེ་པད་མ་བཞིན་དུ་གོས་པ་མེད་པར་འགྱུར་རོ།
en: Although they appear to engage in all worldly and world-transcending activities, they constantly enjoy delighting in the complete pleasure of Dharma. Like a lotus flower, they do not become sullied.

source: །སྤྲིན་ཆེན་སྙིང་པོ་ཟབ་མོ་བརྟན་པའི་ཆུའི་རྒྱ་མཚོའི་དུས་ཚོད་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་ཡུལ་ལ་ལྟོས།། །།
en: Great Cloud Essence, observe the domain of this samādhi of the tide of the deep, constant ocean!”

source: འཕགས་པ་སྤྲིན་ཆེན་པོའི་མདོ། བམ་པོ་བདུན་པ། དེ་ནས་དེའི་ཚེ་འཁོར་ཆེན་པོའི་ནང་ནས་སློབ་དཔོན་ལུང་སྟོན་པ་བྲམ་ཟེ་ཀཽཎྜི་ནྱ་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then at that time, a brahmin named Kauṇḍinya, a master grammarian, set forth from the great assembly and addressed the Bhagavān, saying “Alas, Bhagavān!

source: །བཅོམ་ལྡན་འདས་ཀྱེ་མ་ལྷ་སྦྱིན་དྲུག་སྡེ་དང་བཅས་པ་ནི་ཚིག་གི་དོན་ཕྲ་ཞིང་ཟབ་ལ་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་སྤྱོད་པ་འདི་ལྟ་བུ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་ལགས་སོ།
en: Devadatta and the group of six monks have together turned their backs on such words as these, whose meanings are subtle and profound, and which are employed for the benefit of all sentient beings.

source: །ཀྱེ་མ་ལྷ་སྦྱིན་ནི་བྱས་པ་མི་གཟོ་བ་ལགས་སོ།
en: Alas! Devadatta is ungrateful.

source: །ཀྱེ་མ་ལྷ་སྦྱིན་ནི་སྡིག་པ་འདོད་པ་ལགས་སོ།
en: Alas! Devadatta desires to do evil.

source: །ལྷ་སྦྱིན་ནི་དེ་བཞིན་གཤེགས་པ་ལ་ཁྲག་འབྱིན་པ་ལགས་སོ།
en: Devadatta draws the blood of the Tathāgata.

source: །ཀྱེ་མ་ལྷ་སྦྱིན་དྲུག་སྡེ་དང་བཅས་པ་ནི་དགེ་འདུན་གྱི་དབྱེན་བགྱིད་པ་ལགས་སོ།
en: Alas! Devadatta and the group of six monks create schism among the saṅgha.

source: །ཀྱེ་མ་ལྷ་སྦྱིན་དྲུག་སྡེ་དང་བཅས་པ་ནི་ཤཱཀྱ་རིགས་ཀྱིས་དྲེགས་པ་ལགས་སོ།
en: Alas! Devadatta and the group of six monks are arrogant about belonging to the Śākya family.

source: །ཀྱེ་མ་མི་ལེགས་པར་འགྱུར་བར་འོས་པ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་ཕྲད་པར་འགྱུར་བ་ཡོངས་སུ་སྤྱོད་པ་ལགས་སོ།
en: Alas! They engage in conduct that brings misfortune and results in rebirth among the animals.

source: །ཀྱེ་མ་ལྷ་སྦྱིན་ནི་རྟག་ཏུ་བཅོམ་ལྡན་འདས་བགྲོངས་པར་སེམས་པ་དང་སྐྱེས་པའི་རབས་བརྒྱ་སྟོང་ཕྲག་བགྲོངས་པར་ལས་དྲག་པོ་བགྱིད་པ་ལགས་སོ།
en: Alas! Devadatta constantly thinks of killing the Bhagavān, and he has engaged in violent actions for a hundred thousand lifetimes.

source: །ལྷ་སྦྱིན་ནི་སེམས་ཅན་དམྱལ་བར་མཆི་བ་ལགས་སོ།
en: Devadatta will go to the hell realms.

source: །ཀྱེ་མ་ལྷ་སྦྱིན་ནི་སྩལ་བ་དང་། བགྱིས་པ་མ་མཆིས་པ་ལགས་སོ།
en: Alas! For Devadatta, there is no giving and no action.

source: །བཅོམ་ལྡན་འདས་ཀྱི་བཀའ་དྲིན་གྱིས་འཚོ་ལ། བཅོམ་ལྡན་འདས་ཀྱི་རྩ་བ་ལ་རྐོ་བ་ལགས་སོ།
en: While the Bhagavān has looked after him out of kindness, he has sought to dig up the Bhagavān’s roots.

source: །ཀྱེ་མ་ལྷ་སྦྱིན་ནི་སྡིག་པ་ལ་ངེས་པ་ལགས་སོ།
en: Alas! Devadatta is determined to do evil.

source: །ལྷ་སྦྱིན་གྱི་འཁོར་ནི་བདུད་ཀྱི་ཕྱོགས་ལགས་ན། བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་རབ་ཏུ་བྱུང་ཞེས་གདའ་སྟེ། བཅོམ་ལྡན་འདས་བགྲོངས་པར་སེམས་སོ།
en: Devadatta’s followers belong to the faction of Māra; they stand before the Bhagavān and say that they will ‘go forth to renunciation’ while thinking of killing the Bhagavān.

source: །ལྷ་སྦྱིན་གྱི་འཁོར་ནི་ཐམས་ཅད་ཀྱང་ངུར་སྨྲིག་འཆང་བ་ཙམ་དུ་བས་སོ།
en: Although Devadatta’s followers all don the saffron robes, they merely wear them and nothing more.

source: །ལྷ་སྦྱིན་གྱི་འཁོར་ནི་འཚོ་བ་ངན་པས་འཚོ་ཞིང་མུ་གེའི་མགོ་བྱི་ལགས་སོ།
en: Since Devadatta’s followers live lives of deprivation, they are famished bald-heads. “

source: །བཅོམ་ལྡན་འདས་ཁྱོད་ནི་ཐམས་ཅད་མཁྱེན་པ་ལགས་ཞེས་གདའ།
en: Bhagavān, it is said that you are omniscient.

source: ཁྱོད་ནི་འབྲས་བུ་མཆིས་པའི་ཆོས་སྟོན་པ་ལགས་ཞེས་གདའ།
en: It is said that you teach the doctrine of the existence of fruition.

source: ཁྱོད་ནི་རིགས་རྣམ་པར་དག་པར་གྲགས་པ་ལགས་ཞེས་གདའ་ན།
en: It is said that you are renowned for the purity of your family.

source: ལྷ་སྦྱིན་མ་རུངས་པ་འདི་ལྟ་བུ་ཡང་རབ་ཏུ་ཕྱུང་ལགས་སམ།
en: If so, then why is it that you would allow one as wicked as Devadatta to go forth to renunciation?
